code-review/NRB_3471_3546/База_Было/InformationRegisters/РегистрацияИнтеграционныхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РегистрацияИнтеграционныхСобытий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Comment>Высокоуровневое описание события</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УспешноеЗавершение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УниверсальнаяДатаСобытия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторВызова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Система</Name>
					<Comment>Система, с которой производится взаимодействие.</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВнешниеИсточники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъектСистемы</Name>
					<Comment>Объект системы который участвуется в интеграционном вызове.</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделительСобытий</Name>
					<Comment>Технический реквизит, используется для возможности записи с идентичными измерениями.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/РегистрацияИнтеграционныхСобытий/Ext/ManagerModule.bsl
Процедура ДобавитьЗапись(СквознойИдентификаторВызова, Система, СсылкаНаОбъект, Событие, УспешноеЗавершение, Комментарий = "") Экспорт
	
	НовЗапись = РегистрыСведений.РегистрацияИнтеграционныхСобытий.СоздатьМенеджерЗаписи();
	НовЗапись.Система = Система;
	НовЗапись.СсылкаНаОбъектСистемы = СсылкаНаОбъект;
	НовЗапись.РазделительСобытий = Новый УникальныйИдентификатор;
	НовЗапись.Событие = Событие;
	НовЗапись.УспешноеЗавершение = УспешноеЗавершение;
	НовЗапись.Комментарий = "По входящему пакету из файлового шлюза не сопоставлен документ ""Техническая операция"".";
	НовЗапись.ДатаСобытия = ТекущаяДатаСеанса();
	НовЗапись.УниверсальнаяДатаСобытия = ТекущаяУниверсальнаяДата();
	НовЗапись.ИдентификаторВызова = СквознойИдентификаторВызова;
	НовЗапись.Записать();
	
КонецПроцедуры
